Repository: 84000/data-translation-memory
Catalog: toh55_84000-the-teaching-on-the-effulgence-of-light.tmx
Source language: bo
Languages: en

source: །བདག་དང་སྐྱེས་བུ་མེད་པ་དང་། །སེམས་དང་སྲོག་ནི་མེད་པ་དང་། །དེ་བཞིན་གང་ཟག་མེད་པ་དང་། །མཚན་མ་མེད་ཅིང་བྱེད་མེད་དང་། །འགྲོ་བ་མེད་ཅིང་འོང་མེད་དང་། །འདི་ལྟ་བུ་ལ་སོགས་པའི་མཚན།
en: “Are devoid of self, being, Mind, life principle, Person, marks, action, Going, coming, and so forth.

source: །ཐམས་ཅད་རྟོགས་པར་འགྱུར་ཞེས་ཟེར།
en: “Furthermore, they cause one to realize The eye of reality,

source: །གཞན་ཡང་འདི་སྐད་ཆོས་ཉིད་ཀྱི།
en: The eye accomplished on the basis of Dharma teachings,

source: །མིག་ནི་རྟོགས་པར་འགྱུར་ཞེས་ཟེར།
en: The eye of wisdom, the eye of insight,

source: །གཞན་ཡང་འདི་སྐད་ཆོས་རྣམས་ལས།
en: “The eye of Brahmā, the divine eye, The eye achieved by being born in the Brahmā realms, The eye achieved by being born in the god realms, The eye of the karmic ripening of Brahmā, “The eye of the karmic ripening of the gods,

source: །གྲུབ་པའི་མིག་ནི་གང་ཡིན་དང་། །ཡེ་ཤེས་མིག་དང་ཤེས་རབ་མིག །ཚངས་པའི་མིག་དང་ལྷ་མིག་དང་། །ཚངས་པར་སྐྱེས་ནས་ཐོབ་མིག་དང་། །ལྷར་ནི་སྐྱེས་ནས་ཐོབ་མིག་དང་། །ཚངས་པའི་རྣམ་སྨིན་མིག་དག་དང་། །ལྷ་ཡི་རྣམ་སྨིན་མིག་དག་དང་། །ཚངས་པའི་རྒྱུ་ལས་སྐྱེས་མིག་དང་། །ལྷ་ཡི་རྒྱུ་ལས་སྐྱེས་པའི་མིག །ལྷ་ཡི་རྫུ་འཕྲུལ་མིག་དག་དང་། །ལྷ་ཡི་བརྩོན་འགྲུས་དག་གི་མིག །དམན་པར་སྐྱེས་པའི་མིག་དག་དང་། །ཁྱད་འཕགས་སྐྱེས་པའི་མིག་དག་དང་། །གཤིན་རྗེའི་འཇིག་རྟེན་གང་ཡིན་པ།
en: The eye arising from the causes of Brahmā, The eye arising from the causes of the gods, The eye of divine miraculous powers, “The eye of divine diligence, The eye of inferior births, The eye of noble births, The eye that relinquishes the world of the lord of death,

source: །ཡོངས་སུ་སྤངས་པའི་མིག་དག་དང་། །ཀླུ་དང་གནོད་སྦྱིན་མིག་དག་དང་། །གྲུལ་བུམ་གྱི་ནི་མིག་དག་དང་། །ཡོངས་སུ་གདུང་བཅས་མིག་དག་དང་། །ཡོངས་སུ་གདུང་མིན་མིག་དག་དང་། །རྣམ་པར་དག་པའི་མིག་དག་དང་། །རྣམ་པར་དག་མིན་མིག་དག་དང་། །ཆུར་རིང་ཞེང་ཐུང་མིག་དག་དང་། །ཉན་ཐོས་ཐེག་པའི་མིག་དག་དང་། །བསམ་གཏན་པ་ཡི་མིག་དག་དང་། །ཏིང་ངེ་འཛིན་གྱི་མིག་དག་དང་། །སྤྱོད་ཡུལ་ལས་བྱུང་མིག་དག་དང་། །འདུ་ཤེས་ལས་བྱུང་མིག་དག་དང་། །འདོད་ཆགས་ལས་བྱུང་མིག་དག་དང་། །འདོད་ཆགས་བྲལ་བའི་མིག་དག་དང་། །རྒྱུ་ལས་བྱུང་བའི་མིག་དག་དང་། །རྒྱུ་མིན་ལས་བྱུང་མིག་དག་དང་། །མཚུངས་པར་ལྡན་པའི་མིག་དག་དང་། །མཚུངས་པར་ལྡན་མིན་མིག་དག་དང་། །སྒོ་བརྟེན་ལས་བྱུང་མིག་དག་དང་། །སྒོ་ལས་བྱུང་མིན་མིག་དག་དང་། །རྒྱུ་རྐྱེན་ལས་བྱུང་མིག་དག་དང་། །རྒྱུ་སྒོ་ལས་སྐྱེས་མིག་དག་དང་། །ཤ་ལས་གྲུབ་མིན་མིག་དག་དང་། །ཡེ་ཤེས་རྣམ་པར་དག་མིག་དང་། །ཡོད་པ་མིན་པའི་མིག་དག་དང་། །དམིགས་མེད་མིག་ནི་གང་ཡིན་པ།
en: “The eye of the nāgas, the yakṣas, and the kumbhāṇḍas, The eye associated with torment, The eye free of torment, The pure eye, the impure eye, “The broad eye and the narrow eye, The eye of the hearer’s vehicle,

source: །ཐམས་ཅད་རྟོགས་པར་བྱེད་ཅེས་ཟེར།
en: The eye of concentration,

source: །ཆོས་ནི་རྣམ་པ་ཉི་ཤུ་ལྔ། །ཐམས་ཅད་དེ་བཞིན་སྦྱར་ཞེས་ཟེར། །དེ་ཡི་ཚེ་ན་བཅོམ་ལྡན་འདས།
en: The eye arising from perception,

source: །གཞན་ཡང་དཔག་ཏུ་མེད་པའི་སྒྲ།
en: The eye free from desire,

source: །སྒྲ་སྙན་དམ་པ་མཆོག་བྱུང་ནས། །ཁྱད་པར་འཕགས་པ་གཟུངས་ཀྱི་ཆོས། །འདི་སྐད་དུ་ནི་བཀའ་སྩལ་ཏེ། །འདི་ཡང་དེ་བཞིན་གཤེགས་པ་ཡིས། །རྫུ་འཕྲུལ་དག་གིས་སྤྲུལ་པ་ཡིན། །འདི་ལྟ་སྟེ། སི་ལེ། །མ་ལེ་མ་ལེ། སིད་དྷེ།
en: “The eye arising from causes,

source: ཨཻ་ནི། སི་ཎེ།
en: The eye arising from non-causes,

source: ཀུ་ལུ་ནི་ཡུ།
en: The concurrent eye,

source: ཀུ་ལུ་ནེ་ཡུ། ཀུ་ལེ་མ་ལེ། ཀུ་ནོ་ཏེ། ཨ་ལ་ཤི།
en: The nonconcurrent eye,

source: ཨ་སི་ལེ། སི་སི་ལེ་ཏེ། སུ་སི་ལེ། སི་ལེ་སི་ལེ། ཁྱི་བི་ལེ། ཨ་བི་ལེ། སུ་ཊེ་ཙ་ན།
en: “The eye arising based on the gateways,

source: དྷ་ནི་མ་ནི།
en: The eye not arising from the gateways,

source: ཀ་ནི།
en: The eye arising from causes and conditions,

source: ཀ་ལ་ཏེ། སུ་ཀ་ལེ། པྲ་ཡ།
en: The eye arising from the gateway of the cause,

source: ཤ་ནང་ནི།
en: “The eye not made of flesh, The eye of pure wisdom,

source: ཨ་ནུ་ལོ་སི་ཀྱི། བི་ལོ་མེ། སུ་བྷ་ནི་རེ་ཤྷེ། ཨ་ཤི་རི་ལེ།
en: The eye of nonexistence,

source: སར་མ་པར་ཕུན་ཏེ། པ་རི་བྷ་ཧེ།
en: And the eye of nonapprehending.

source: དྷ་ར་ནི།
en: “The same applies

source: དྷེ་ཤུ་ཙི་ཧ། སུ་དྷེ།
en: To all the twenty-five phenomena—

source: ཨ་ཙ་ན། བྷུ་བོ་ག་གནང་།
en: From the ear, the nose, the tongue, and the body

source: ཀུད་བ་ནོ།
en: Up to words and names.” At that moment, through the Thus-Gone One’s miraculous powers,

source: བྷ་ས་བྷ་ནང་། པན་རི་དྷུ་རི་ཡ། ནི་པ་རི་ཀ་ནོ་ནི། མ་ནཾ་བྷ། སུ་རུ་ཙི་ཊ། པ་ན་ཨཱ་ཙ་ར།
en: The Blessed One manifested in the sky

source: ཨ་བྷེ་ལ་བིརྱ་པྲ་ཏི་ཤྠ་ཧ།
en: The most sublime, boundless, and melodious voices,

source: དྷ་རི་ནི། ཨ་སི་ཊ།
en: Which proclaimed this exalted dhāraṇī Dharma: Sile male male siddhe aini siṅe kulu niyu kulu neyu kule male kunote alaśi asile sisilete susile sile sile khyivile avile suṭecana dhani mani kani kalate sukale praya śanaṅni anulosikye bilome subhanireśhe aśirile saramaparaphunte paribhahe dharani dheśuciha sudhe acana bhuvogaganaṅ kudpano bhasabhanaṅ panridhuriya niparikanoni manaṃbha suruciṭa pana-ācara abhelaviryapratiṣṭha ha dharini asiṭa loṅibhi

source: ལོ་ཎི་བྷི། གཟུངས་རྣམས་གང་ཡིན་འདི་དག་ནི། །སངས་རྒྱས་རྣམས་ཀྱིས་རབ་ཏུ་བརྙེས།
en: “These dhāraṇīs have been obtained by the buddhas.

source: །མཐུ་ཆེན་དག་ནི་ཕུན་སུམ་ཚོགས། །ཤེས་རབ་དག་ནི་ཚད་ཀྱང་མེད།
en: Their great powers are complete, and their insights are infinite;

source: །འཛིན་པ་དག་ནི་ཡོངས་སུ་སྤོང་།
en: They cause one to abandon clinging,

source: །དྲན་པ་དག་ནི་དག་པར་བྱེད།
en: And they purify recollection.

source: །གཟུགས་མེད་འགྲོ་དང་འོང་བ་མེད།
en: “They are formless, beyond coming and going,

source: །ཕྱོགས་དང་ཕྱོགས་མཚམས་ཡོད་པ་མིན།
en: Beyond all cardinal and intermediate directions,

source: །མཚན་མ་མེད་ཅིང་བརྗོད་དང་བྲལ།
en: Devoid of marks, inexpressible,

source: །སྤྲོས་པ་དག་ལས་ཡང་དག་འདས།
en: And beyond concepts.

source: །བྱང་ཆུབ་སེམས་དཔས་སྒྲུབ་བྱེད་ན། །མཐར་ནི་བསིལ་བ་འཐོབ་པར་འགྱུར།
en: “If bodhisattvas accomplish them, they will eventually attain coolness.

source: །ཚིགས་སུ་བཅད་པ་བྱེ་བ་ཕྲག །བརྒྱ་སྟོང་མང་པོ་དག་གིས་ནི། །ཚིག་གཅིག་ཙམ་ནི་རང་བསྟན་ཀྱང་།
en: Even if each of their words were explained Through hundreds of billions of verses,

source: །མཐའ་ནི་དམིགས་པར་ཡོང་མི་ནུས།
en: Their scope could never be apprehended.

source: །འཕགས་པ་མང་པོས་རབ་ཏུ་བསྔགས།
en: “They are praised by many noble beings,

source: །རྣམ་པར་དག་ཅིང་ཞེན་པ་མེད།
en: And highly revered

source: །འཁོར་འདུས་མང་པོ་ཐམས་ཅད་ཀྱིས།
en: By all the numerous assemblies That are pure and free from clinging.

source: །ཤིན་ཏུ་གུས་པ་སྐྱེད་པར་བྱེད།
en: “Through the power of the virtue

source: །གཟུངས་ནི་གང་ཡིན་འདི་དག་གི །དགེ་བའི་ཆོས་ཀྱི་མཐུ་སྟོབས་ཀྱིས།
en: Created by these dhāraṇīs,

source: །ཉོན་མོངས་རབ་བཅོམ་ཉེར་ཞི་ནས།
en: Afflictions are completely overcome and pacified,

source: །ཁྱད་འཕགས་ཕན་ཡོན་ཐོབ་པར་བྱེད།
en: And the most excellent benefits are gained.

source: །ཡོན་ཏན་དང་ནི་ཤེས་རབ་དག །ཤིན་ཏུ་རྒྱ་ཆེ་རྒྱ་མཚོ་འདྲ།
en: “They lead to qualities and insight as great as a vast ocean,

source: །བཟོད་པ་དག་ནི་སྒྲུབ་པར་བྱེད།
en: They cause one to achieve acceptance,

source: །སེམས་ནི་རབ་བདེ་གཡོ་མེད་འགྱུར།
en: And they cause the mind to be at ease and unshakable.

source: །བྱང་ཆུབ་སེམས་དཔས་རྟག་ཏུ་བསྒོམས། །མཁས་པ་དག་གིས་རབ་ཏུ་བསྔགས།
en: They are always cultivated by the bodhisattvas and praised by the wise.

source: །དབུལ་ཕོངས་དག་ནི་སྤོང་བྱེད་ཅིང་། །ནོར་དང་རིན་ཆེན་འཐོབ་པར་བྱེད།
en: “They liberate from poverty and provide wealth and prosperity.

source: །གཟུངས་ནི་གང་ཡིན་འདི་དག་གིས། །ཡོན་ཏན་རྣམས་ནི་འཕེལ་བར་བྱེད།
en: These dhāraṇīs increase qualities

source: །རྟག་ཏུ་སྟོང་ཉིད་ལ་སོགས་པའི།
en: And cause one to be constantly adorned

source: །བདེན་ཚིག་དག་གིས་རབ་ཏུ་བརྒྱན།
en: By words of truth, such as emptiness

source: །ཡི་གེ་དག་ནི་སྤངས་པས་ན།
en: “Since they go beyond words,

source: །སྟོང་པའི་ངོ་བོ་ཉིད་ཅེས་བྱ།
en: They are known as empty essence

source: །སེམས་དང་རྣམ་ཤེས་སྤངས་པས་ན།
en: Since they go beyond mind and consciousness,

source: །ཆོས་ཀྱི་ངོ་བོ་ཉིད་ཅེས་བྱ། །གཟུངས་ནི་གང་ཡིན་འདི་དག་གིས།
en: They are known as essence of phenomena

source: །དྲི་བྲལ་རྟག་ཏུ་རྣམ་དག་བྱེད།
en: “These dhāraṇīs always lead to stainlessness and purity.

source: །ཡང་དག་ཡེ་ཤེས་ལ་གནས་ནས།
en: Being grounded in genuine wisdom,

source: །ཕན་པ་སྣ་ཚོགས་སྟོན་པར་བྱེད།
en: They reveal many benefits

source: །དགའ་ཞིང་དང་བ་སྐྱེད་པར་བྱེད།
en: “They bring great delight

source: །གནོད་སྦྱིན་འཁོར་ནི་ཚད་མེད་དང་། །གྲུལ་བུམ་འཁོར་ནི་གང་ཡིན་པ།
en: To the countless retinues of yakṣas, The retinues of kumbhāṇḍas,

source: །འདི་ལ་སོགས་པ་ཡི་དགས་རྒྱལ། །དགའ་བ་ཆེན་པོ་སྐྱེད་ཅེས་ཟེར།
en: And also the rulers of the starving spirits.

source: །གཟུངས་སྔགས་གང་ཡིན་འདི་དག་ནི།
en: “These dhāraṇī mantras

source: །རབ་ཏུ་ཞི་ཞིང་སྤྲོས་པ་མེད། །སེམས་ཅན་དག་ལ་བྱམས་པས་ན།
en: Are utterly peaceful and beyond concepts.

source: །ཀུན་ལ་བདེ་བ་སྦྱིན་པར་བྱེད།
en: They cause happiness to manifest for all beings Out of love for them. “Though they constantly remain within the realms of beings

source: །བསྐལ་བ་མང་པོ་བརྒྱ་སྟོང་དུ། །འགྲོ་བ་རྣམས་སུ་རྟགས་གནས་ཤིང་།
en: For hundreds of thousands of eons,

source: །ཕན་པ་ཚད་མེད་རབ་བྱེད་ཀྱང་།
en: Bringing infinite benefits,

source: །རྣམ་པར་དག་ཅིང་གོས་པ་མེད།
en: They remain immaculate and unsullied. “They bring great joy

source: །ཚིགས་སུ་བཅད་པ་བརྒྱ་སྟོང་གིས།
en: To countless sentient beings

source: །བདུད་རྩིའི་ཆོས་ནི་རབ་བསྟན་ནས།
en: By revealing the ambrosia-like Dharma

source: །སེམས་ཅན་དག་ནི་ཚད་མེད་རྣམས། །དགའ་བ་ཆེན་པོ་སྐྱེད་པར་བྱེད།
en: Through hundreds of thousands of verses.

source: །སྔོན་གྱི་སངས་རྒྱས་ཚད་མེད་རྣམས། །ཤིན་ཏུ་རྣམ་དག་མོས་པ་ཡིས།
en: “The countless buddhas of the past

source: །གཟུངས་འདི་ལ་ནི་བརྟེན་ནས་སུ།
en: Relied on these dhāraṇīs With the purest trust

source: །རྟག་ཏུ་ཆོས་ཉིད་དགོངས་པར་མཛད།
en: And so perpetually realize reality. “When they hear these dhāraṇīs,

source: །ཚངས་དང་བརྒྱ་བྱིན་ལྷ་རྣམས་དང་། །ཀླུ་ཡི་རྒྱལ་པོ་ལྷ་མ་ཡིན། །གཟུངས་འདི་ཐོས་བར་གྱུར་ནས་ཀྱང་།
en: The minds of Brahmā, Śakra, the gods, The kings of the nāgas, and the asuras

source: །སེམས་ཀྱིས་དགའ་བ་སྐྱེད་ཅེས་ཟེར།
en: Become filled with joy.

source: །གཟུངས་སྔགས་གང་ཡིན་འདི་དག་རྣམས། །གང་དུ་གནས་པའི་ཡུལ་དེར་ནི།
en: “The lands where these dhāraṇī mantras are found

source: །རྟག་ཏུ་གནོད་དང་འཁྲུགས་པ་དང་། །ནད་དང་སྡུག་བསྔལ་མྱ་ངན་མེད།
en: Remain perpetually free from harm, Turmoil, diseases, Suffering, and misery. “With minds filled with joy,

source: །སེམས་ཅན་དག་ནི་ཐམས་ཅད་ཀུན། །སོ་སོར་དགའ་བའི་སེམས་བསྐྱེད་ནས།
en: All sentient beings make the aspiration

source: །གཟུངས་འདི་རྟག་ཏུ་བདག་ཅག་གི །སེམས་ལ་གནས་པར་སྨོན་ལམ་འདེབས།
en: That these dhāraṇīs Constantly remain within their minds.

source: །ལུས་དང་སེམས་དང་རྐན་དག་དང་། །ཁ་མཆུ་དག་ལ་གནས་གྱུར་ན།
en: Always remain connected to the body, the mind, The palate, the mouth, and the lips,

source: །ཡོན་ཏན་དཔག་མེད་སྐྱེད་པར་བྱེད།
en: Boundless qualities will be generated.

source: །གལ་ཏེ་རྟག་ཏུ་འཛིན་བྱེད་ན།
en: “If they are held constantly,

source: །ཡོན་ཏན་ཚད་མེད་ཐོབ་གྱུར་ནས།
en: Countless qualities will be achieved,

source: །སེམས་ཅན་མང་ལ་ཕན་འདོགས་ཤིང་།
en: Many sentient beings will benefit,

source: །ཐམས་ཅད་དགའ་བ་ཐོབ་ཅེས་ཟེར།
en: And everyone will experience joy.

source: །གཟུངས་སྔགས་གང་ཡིན་འདི་དག་གིས།
en: “Since these dhāraṇī mantras

source: །སྡིག་པ་རྣམས་ནི་རབ་སྤོང་ཞིང་།
en: Cause one to abandon negative deeds

source: །དམ་ཆོས་དག་ནི་སྟོན་བྱེད་པས།
en: And reveal the sacred Dharma,

source: །ཐུག་པ་མེད་པའི་སྤོབས་པ་འཐོབ།
en: Infinite eloquence will be achieved.

source: །སེམས་ཅན་དག་ནི་བརྒྱ་སྟོང་རྣམས།
en: “The doubts of hundreds of thousands of sentient beings

source: །ཐེ་ཚོམ་དག་ནི་རབ་བསལ་ནས།
en: Will be cleared away,

source: །ང་རྒྱལ་རྣམས་ནི་རབ་བཅོམ་སྟེ།
en: Pride will be overcome,

source: །ཡོན་ཏན་དཔག་མེད་འཐོབ་ཅེས་ཟེར། །ཤིན་ཏུ་ཟབ་ཅིང་གསང་བའི་ཆོས། །གཟུངས་སྔགས་གང་ཡིན་འདི་དག་ནི།
en: And boundless qualities will be achieved.

source: །མཁས་པས་རྟག་ཏུ་སེམས་བྱེད་ཅིང་།
en: “The wise always contemplate

source: །ནན་ཏན་གྱིས་ནི་སྒྲུབ་པར་བྱེད།
en: And persistently accomplish These dhāraṇī mantras— These utterly profound and secret teachings.

source: །ཤེས་རབ་གོ་ཆ་རབ་བགོས་ནས།
en: “Donning the armor of insight,

source: །ཉོན་མོངས་རབ་ཏུ་འཇོམས་པར་བྱེད།
en: They completely overcome the afflictions

source: །ཡོན་ཏན་སེམས་ཅན་ནི་འཕེལ་བྱེད་པས།
en: And develop the qualities of their minds

source: །རབ་ཏུ་མོས་ཤིང་སྐྱོ་བ་མེད།
en: With great dedication and without feeling weary. “These glorious and excellent

source: །གྲགས་པ་ཆེན་པོ་ཕུན་ཚོགས་པས།
en: Cause beings to realize the limits

source: །ཟད་པ་དང་ནི་མི་ཟད་དང་། །སྐྱེ་དང་མི་སྐྱེ་མཐའ་རབ་རྟོགས།
en: Of exhaustion, non-exhaustion, arising, and non-arising. “Since they are adorned

source: །འདི་འདྲའི་ཤེས་རབ་སྣ་ཚོགས་ཀྱིས། །བདག་ཉིད་རབ་ཏུ་བརྒྱན་པས་ན།
en: With those various insights,

source: །དེ་བཞིན་གཤེགས་པ་བརྒྱ་སྟོང་རྣམས།
en: Hundreds of thousands of thus-gone ones

source: །ཤིན་ཏུ་གུས་ཤིང་མཆོད་པ་མཛད།
en: Revere and worship them.

source: །དེ་འདྲའི་གཟུངས་ནི་གང་ཡིན་པ།
en: “These dhāraṇīs

source: །རིག་པ་དག་གིས་རྐང་གཉིས་བྱེད།
en: Produce the two feet of knowledge,

source: །ཏིང་འཛིན་མཆོག་ལ་རབ་གནས་ནས།
en: Place one firmly within the supreme absorption,

source: །བྱང་ཆུབ་ལམ་ལ་གཞོལ་བར་བྱེད།
en: And cause one to follow the path to awakening;

source: །ཞི་གནས་ལྷག་མཐོང་རྗེས་འབྲང་ཞིང་།
en: “They cause one to pursue tranquility and insight

source: །ཟག་མེད་ཤེས་རབ་རྟོགས་པར་བྱེད།
en: And to realize undefiled insight.

source: །རབ་དང་དབང་པོ་སྟོབས་ཀྱིས་ནི།
en: Through the strength of the faculty of deep faith,

source: །ལག་གཉིས་ཡོངས་སུ་གྲུབ་པར་བྱེད།
en: They perfect the two hands. “They cause one to achieve the two breasts

source: །བརྩོན་འགྲུས་དང་ནི་བཟོད་པ་ཡིས།
en: Through diligence and patience,

source: །ནུ་མ་གཉིས་ནི་གྲུབ་པར་བྱེད།
en: And to achieve the characteristics of the crown of the head

source: །ཤེས་རབ་ཕ་རོལ་ཕྱིན་པས་ནི། །སྤྱི་གཙུག་མཚན་ཉིད་རབ་ཏུ་བྱེད།
en: Through the perfection of insight.

source: །མདོ་སྡེ་དག་གིས་སྐུད་བྱས་ནས།
en: “By making a thread with those discourses

source: །སོ་སོར་རིག་བཞི་ཕྲེང་བ་བརྒྱུས།
en: And using it for the garland of the four individual knowledges, One will be adorned with all the various unequaled qualities

source: །སྔོན་ནི་མངོན་པར་བསྒྲུབས་པ་ཡི།
en: That were accomplished in the past. “Since these dhāraṇī mantras

source: །ཡོན་ཏན་རྣམ་པ་སྣ་ཚོགས་དང་། །དཔེ་ནི་ཚད་མེད་ཇི་སྙེད་པ།
en: Are endowed with countless excellent qualities,

source: །ཐམས་ཅད་རབ་ཏུ་བརྒྱན་ཅེས་ཟེར།
en: One will realize all the gateways,

source: །ཡོན་ཏན་ཚད་མེད་ཕུན་ཚོགས་པས།
en: “The limits of its exhaustion and non-exhaustion, Its arising and non-arising,

source: །མིག་གི་སྔོན་དང་ཕྱི་མཐའ་དང་། །ཟད་དང་མི་ཟད་མཐའ་དག་དང་། །སྐྱེ་བ་དང་ནི་མི་སྐྱེ་དང་། །མཐའ་དང་མཐའ་མིན་གང་ཡིན་དང་། །དབེན་པ་དང་ནི་མི་དབེན་དང་། །འཇུག་པ་དང་ནི་འཇུག་མིན་དང་། །ཅི་ཡང་མེད་དང་མི་འབྱུང་དང་། །ཉེར་ཞི་དང་ནི་བདག་མེད་དང་། །གང་ཟག་མེད་དང་སྲོག་མེད་དང་། །སེམས་ཅན་མེད་པའི་བར་དག་དང་། །འདི་ལ་སོགས་པའི་ཚད་མེད་སྒོ།
en: Its limit and non-limit, Its engagement and disengagement, “Its cognition and noncognition, Its complete nonexistence, its absence of origination, Its quiescence, its absence of self, its absence of person, Its absence of life principle, and its absence of sentient being.

source: །ཐམས་ཅད་རབ་ཏུ་རྟོགས་པར་འགྱུར།
en: “The same applies to the ear, the nose,

source: །འཇིག་རྟེན་སྐྱེ་བའི་མིང་བར་དུ། །ཐམས་ཅད་དེ་བཞིན་སྦྱར་ཞེས་ཟེར།
en: Up to the names produced in the world. “The sublime and sacred dhāraṇīs

source: །གོང་དུ་བསྔགས་པ་བརྗོད་པ་ཡི། །གཟུངས་མཆོག་དམ་པ་གང་ཡིན་པ།
en: That were praised earlier

source: །རབ་དབེན་ཡོན་ཏན་མཆོག་ལྡན་ཞིང་།
en: Are endowed with the qualities of complete disengagement,

source: །སངས་རྒྱས་སྤྱོད་ཡུལ་ཡིན་པས་ན།
en: And they belong to the domain of the buddhas.

source: །གཟུངས་དོན་ཡང་དག་གང་ཡིན་པ།
en: “Therefore, the true meaning of these dhāraṇīs

source: །ཡི་གེས་བརྗོད་བྱ་མ་ཡིན་ཡང་།
en: Cannot be expressed in words.

source: །འཇིག་རྟེན་པ་ཡི་རྗེས་སུ་ནི།
en: Nevertheless, to accord with worldly beings,

source: །བཏགས་པའི་མིང་གིས་བརྗོད་པ་ཡིན།
en: They have been expressed here with imputed words.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་འཁོར་མང་པོ་དང་ཐབས་ཅིག་ཏུ་ཟླ་འོད་གཞོན་ནུའི་ཁྱིམ་དུ་བྱོན་པ་དང་། གདན་བཤམས་པ་ལ་རབ་ཏུ་བཞུགས་སོ། །དེའི་ཚེ་ཟླ་འོད་གཞོན་ནུར་གྱུར་པས་བཅོམ་ལྡན་འདས་གདན་ལ་བཞུགས་པར་རིག་སྟེ།
en: Then, together with his numerous retinues, the Blessed One arrived at the house of Candraprabhakumāra and sat down on the throne that had been prepared for him.

source: བདག་ཉིད་མཆོད་པའི་ཡོ་བྱད་མཆོག་དམ་པ་ཐོགས་ནས།
en: When he saw the Blessed One sitting on the throne, Candraprabhakumārabhūta brought the most sublime offering articles and offered them to the Thus-Gone One and his great assemblies.

source: དེ་བཞིན་གཤེགས་པ་དང་འཁོར་འདུས་པ་ཆེན་པོ་རྣམས་ལ་རབ་ཏུ་ཕུལ་ཏེ་མཆོད་པ་དེ་ཡང་བསམ་གཏན་དང་། ཏིང་ངེ་འཛིན་དང་། བསམ་གཏན་གྱི་ཡོན་ཏན་ཁྱད་པར་དུ་འཕགས་པའི་དགེ་བའི་རྩ་བ་དང་བསམ་གྱིས་མི་ཁྱབ་པའི་མཐུ་ལས་མངོན་པར་གྲུབ་པ་ཤ་སྟག་གོ །དེ་ལྟར་མཆོད་པ་ཕུལ་བ་ཡང་བདག་འབའ་ཤིག་གི་ཕྱིར་མ་ཡིན་གྱི་སེམས་ཅན་ཚད་མེད་པ་ཐམས་ཅད་བླ་ན་མེད་པའི་བྱང་ཆུབ་ལ་གཞོལ་ཞིང་ཕན་ཡོན་ཆེན་པོ་འཐོབ་པར་བྱ་བའི་ཕྱིར་མཆོད་ཅིང་ཕུལ་བས་ན་མཆོད་པ་དེས་ཀུན་དུ་ཁྱབ་ཅིང་ཐམས་ཅད་རབ་ཏུ་ཚིམ་པར་གྱུར་ཏོ།
en: That offering was entirely accomplished through his inconceivable power and the roots of virtue generated by his extraordinary concentration, absorption, and concentration qualities. Since he made that offering not only for himself but in order for all the countless sentient beings to strive for awakening and achieve great benefits, that act of worship was all-pervasive and satisfied everyone.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་གདུགས་ཚོད་གསོལ་པའི་འོག་ཏུ་འཁོར་འདུས་པ་མང་པོའི་མདུན་དུ་ཟླ་འོད་གཞོན་ནུར་གྱུར་པ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ།
en: When the Blessed One had finished his lunch, he said these words to Candraprabhakumārabhūta in front of the numerous retinues:

source: །གཞོན་ནུ་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་གང་ལ་ལ་ཞིག་ཐེག་པ་ཆེན་པོ་ལ་གནས་ནས་སྦྱིན་པའི་ཚོགས་མངོན་པར་སྒྲུབ་པར་བྱེད་ན་ཡོན་ཏན་ཁྱད་པར་དུ་འཕགས་པ་རྣམ་པ་བརྒྱད་ཅུ་དང་ལྡན་པར་འགྱུར་རོ། །རྣམ་པ་བརྒྱད་ཅུ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: “Kumāra, if noble sons or daughters who follow the Great Vehicle accomplish the accumulation of generosity, they will be endowed with eighty types of eminent qualities. What are those eighty? (1) They will ripen sentient beings and attract them with pleasant words. ( ) They will perfect the excellent marks. (3) All their faculties will be complete. (4) They will abandon saṃsāra and actualize nirvāṇa. (5) Their afflictions will be exhausted and they will achieve supreme might. (6) They will be adorned with perfect qualities and buddha realms. (7) Their retinues will be pure. (8) They will be endowed with great majesty. (9) They will be endowed with perfect insight. (10) They will accomplish the most eminent activities.

source: སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད་ཅིང་ཚིག་སྙན་པས་ཡོངས་སུ་སྡུད་པར་བྱེད་པ་དང་། མཚན་གྱ་ནོམ་པ་ཡོངས་སུ་རྫོགས་པ་དང་། དབང་པོ་རྣམས་མ་ཚང་བ་མེད་པ་དང་། འཁོར་བ་སྤངས་ནས་མྱ་ངན་ལས་འདས་པ་མངོན་དུ་བྱེད་པ་དང་། ཉོན་མོངས་པ་རྣམས་ཟད་ནས་དབང་ཕྱུག་མཆོག་འཐོབ་པ་དང་། ཡོན་ཏན་ཕུན་སུམ་ཚོགས་ཤིང་སངས་རྒྱས་ཀྱི་ཞིང་རབ་ཏུ་བརྒྱན་པ་དང་། འཁོར་རྣམ་པར་དག་པ་དང་། གཟི་བྱིན་ཆེན་པོ་དང་ལྡན་པ་དང་། ཤེས་རབ་ཕུན་སུམ་ཚོགས་པ་དང་། སྤྱོད་པ་ཁྱད་པར་དུ་འཕགས་པ་མཆོག་མངོན་པར་གྲུབ་པ་དང་། སྤྱོད་པ་བླ་ན་མེད་ཅིང་མཚུངས་པ་མེད་པ་ཡོངས་སུ་རྫོགས་པ་དང་། བག་ཆགས་ཡང་དག་པར་བཅོམ་ནས་དེ་བཞིན་གཤེགས་པའི་ཐམས་ཅད་མཁྱེན་པའི་སྤྱོད་པ་འཕེལ་བར་བྱེད་པ་དང་། ལུས་དང་རིང་སྲེལ་འཇིག་རྟེན་ཐམས་ཅད་དང་། ཉན་ཐོས་དང་། རང་སངས་རྒྱས་རྣམས་ཀྱིས་མཆོད་པར་འགྱུར་བ་དང་། མ་རུངས་པ་རྣམས་རབ་ཏུ་བཏུལ་བས་མིའི་རྒྱལ་པོ་དང་། ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་གི་རྒྱལ་པོ་དང་། ཚངས་པའི་རྒྱལ་པོ་རྣམས་ཡོངས་སུ་དང་བ་སྐྱེ་བར་འགྱུར་བ་དང་། མཐུ་ཆེན་པོ་དང་ལྡན་པ་དང་། མདོའི་སྡེ་དང་། ཚིགས་སུ་བཅད་པ་དང་། ལུང་དུ་བསྟན་པ་དང་། ཆེད་དུ་བརྗོད་པ་དང་། དབྱངས་ཀྱིས་བསྙད་པ་དང་། རྟོགས་པ་བརྗོད་པ་དང་། གླེང་གཞི་དང་། དེ་ལྟ་བུ་བྱུང་བ་དང་། སྐྱེས་པའི་རབས་དང་། ཤིན་ཏུ་རྒྱས་པ་དང་། རྨད་དུ་བྱུང་བ་དང་། གཏན་ལ་ཕབ་པར་བསྟན་པའི་སྡེའི་བར་དུ་ལེན་པ་དང་། འཛིན་པ་དང་། ཡང་དག་པར་སྟོན་པར་འགྱུར་བ་དང་། སེམས་ལ་ལེ་ལོ་མེད་པ་དང་། ཆོས་ལ་སེར་སྣ་མེད་པ་དང་། སངས་རྒྱས་ཀྱི་ལམ་ལ་ཡང་དག་པར་གནས་པ་དང་། འཇིག་རྟེན་ན་མཆོག་ཏུ་གྱུར་ཅིང་མིང་དང་གཟུགས་ཡོངས་སུ་དག་པར་འགྱུར་བ་དང་། ཆོས་ཀྱི་སྐུ་མངོན་དུ་བྱེད་པར་འགྱུར་བ་དང་། མི་འཇིགས་པ་ཐོབ་པར་འགྱུར་བ་དང་། བསོད་ནམས་ཕུན་སུམ་ཚོགས་པར་འགྱུར་བ་དང་། མུ་སྟེགས་ཅན་རྣམས་ཟིལ་གྱིས་གནོན་པ་དང་། སྐྱེས་བུ་དམ་པའི་ཆོས་ཕུན་སུམ་ཚོགས་པ་དང་། སྡིག་པ་ཅན་གྱི་སྤྱོད་པ་སྤོང་བར་འགྱུར་བ་དང་། བསོད་ནམས་དང་ཡེ་ཤེས་ཀྱི་རྒྱུ་ལ་མངོན་པར་ཡིད་ཆེས་པ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་སྡུད་པར་བྱེད་པ་དང་། བདུད་མང་པོ་ཕམ་པར་བྱེད་པ་དང་། སངས་རྒྱས་ཀྱིས་གསུངས་པའི་ཆོས་བདེན་པ་དག་ལ་ཐེ་ཚོམ་དང་། ནེམ་ནུར་མེད་པ་དང་། འདོད་པ་ངན་པ་རྣམས་རབ་ཏུ་བཅོམ་པ་དང་། གཟི་བྱིན་ཆེན་པོ་དང་ལྡན་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་མངོན་པར་བསྒྲུབས་པས་རྫུ་འཕྲུལ་ཁྱད་པར་དུ་འཕགས་པ་འཐོབ་པར་འགྱུར་བ་དང་། སྐྱེ་ཤི་སྤོང་བར་འགྱུར་བ་དང་། སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད་པ་དང་། སྤྱོད་པ་དཔག་ཏུ་མེད་པའི་བསྔགས་པ་རྗོད་པ་དང་། ཡོན་ཏན་རྣམས་ཡོངས་སུ་སྡུད་པར་འགྱུར་བ་དང་། སེམས་ཅན་རྣམས་ལ་སྤྲོ་བ་སྐྱེད་པ་དང་། ཆོས་ཀྱི་དགའ་བ་ལ་ཡོངས་སུ་སྤྱོད་པར་འགྱུར་བ་དང་། སྦྱིན་པ་གཏོང་བ་མངོན་པར་སྒྲུབ་པར་འགྱུར་བ་དང་། ཡེ་ཤེས་ཆེན་པོའི་སྒོར་འཇུག་པར་འགྱུར་བ་དང་། བྲོ་བར་གྱུར་བའི་ཆོས་ལ་གནས་པར་འགྱུར་བ་དང་། རིགས་ངེས་པ་ཉིད་དུ་འགྱུར་བ་དང་། ཆོས་ཀྱི་བཟོད་པ་བསྒྲུབ་པར་འགྱུར་བ་དང་། སངས་རྒྱས་ཀྱི་ལམ་ལ་བདེ་བར་གནས་པ་གང་ཡིན་པའོ།
en: They will perfect unequaled and unsurpassed conduct. (1 ) They will overcome all latent patterns and develop the omniscient conduct of the thus-gone ones. (13) Their bodies and relics will be worshiped by all worldly beings, hearers, and solitary buddhas. (14) They will tame malevolent beings and therefore generate faith in the rulers of humans, gods, nāgas, yakṣas, asuras, garuḍas, and gods of the Brahmā realms. (15) They will have great power. (16) They will adopt, keep in mind, and teach the sūtras, the verses, the prophecies, the aphorisms, the hymns and praises, the biographies, the narratives, the former events, the former births, the extensive teachings, the marvels, and the profound doctrines. (17) They will not succumb to laziness. (18) They will be free of miserliness with respect to the Dharma. (19) They will genuinely follow the path of the buddhas. ( 0) They will be the most eminent beings within the worlds, and their names and appearances will be completely pure. ( 1) They will actualize the Dharma body. ( ) They will achieve fearlessness. ( 3) They will be endowed with excellent merit. ( 4) They will outshine non-Buddhists. ( 5) They will possess the perfect qualities of sublime beings. ( 6) They will renounce negative forms of conduct. ( 7) They will have complete trust in the causes of merit and wisdom. ( 8) They will gather the qualities of the buddhas. ( 9) They will subjugate many demons. (30) They will have no doubts or hesitations about the true teachings of the Buddha. (31) They will overcome unwholesome desires. (3 ) They will be endowed with great majesty. (33) They will accomplish the bodhisattva conduct and therefore achieve the extraordinary miraculous powers. (34) They will transcend birth and death. (35) They will ripen sentient beings. (36) They will proclaim the praises of boundless conduct. (37) They will develop all excellent qualities. (38) They will generate enthusiasm in sentient beings. (39) They will experience the joy of Dharma. (40) They will accomplish generosity. (41) They will enter the gateway of great wisdom. (4 ) They will abide in the foremost Dharma. (43) They will belong to the definitive family. (44) They will achieve the acceptance of phenomena. (45) They will easily follow the path of the buddhas.

source: །གཞོན་ནུ་རིགས་ཀྱི་བུ་འམ། རིགས་ཀྱི་བུ་མོ་གང་ལ་ལ་ཞིག་སྦྱིན་པའི་ཚོགས་མངོན་པར་སྒྲུབ་པར་བྱེད་ན་ཡོན་ཏན་ཁྱད་པར་དུ་འཕགས་པ་རྣམ་པ་བརྒྱད་ཅུ་པོ་འདི་དག་ཕུན་སུམ་ཚོགས་ཤིང་ཡོངས་སུ་རྫོགས་པར་འགྱུར་རོ།
en: Kumāra, if noble sons or daughters accomplish the accumulation of generosity, they will be endowed with and perfect those eighty types of eminent qualities.”

source: །དེ་ནས་དེའི་ཚེ་བཅོམ་ལྡན་འདས་ཀྱིས་ཚིགས་སུ་བཅད་དེ་བཀའ་སྩལ་པ།
en: At that moment, the Blessed One spoke these verses: “I have briefly described here The eighty supreme benefits

source: བྱང་ཆུབ་སེམས་དཔའ་བློ་ཆེན་གང་།
en: Achieved by the wise bodhisattvas

source: །སྦྱིན་པའི་ཚོགས་དང་ལྡན་པ་ལ། །ཕན་ཡོན་མཆོག་ནི་བརྒྱད་ཅུ་ཡོད།
en: Who are endowed with the accumulation of generosity.

source: །ངས་མདོར་བསྡུས་ཏེ་བསྟན་པ་ཡིན།
en: “I will now teach a little bit About all the qualities,

source: །གཞན་ཡང་དཔག་མེད་བསམ་དཀའ་ཡི། །ཡོན་ཏན་དག་ནི་གང་ཡིན་པ།
en: Boundless and hard-to-conceive,
